app/controllers/groups_controller.rb

	def show
		# if current_user
			@group = Group.find_by_id(params[:id])
			@posts = @group.posts(order: "created_at DESC")
			@snippets = @group.snippets(order: "created_at DESC")

			@commentables = (@posts.to_a + @snippets.to_a).sort_by(&:created_at).reverse[0,5]
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = 1 LIMIT 1
SELECT "posts".* FROM "posts"  WHERE "posts"."group_id" = $1  [["group_id", 1]]
SELECT "snippets".* FROM "snippets"  WHERE "snippets"."group_id" = $1  [["group_id", 1]]