app/controllers/posts_controller.rb

	def new
		@group = Group.find(params[:group_id])
		@user = User.find(params[:user_id])
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]

	def create
		group = Group.find(params[:group_id])
		user = User.find(params[:user_id])
		post = user.posts.new(post_params)
		post.group_id = group.id
		image = post.images.new(picture: params[:post][:picture])

		if post.save
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "images" ("created_at", "imageable_id", "imageable_type", "picture", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-10-10 00:48:07.063389"], ["imageable_id", 6], ["imageable_type", "Post"], ["picture", "Nixon_Small.jpeg"], ["updated_at", "2014-10-10 00:48:07.063389"]]
INSERT INTO "posts" ("content", "created_at", "creator_id", "group_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "Moiasdfkljkas foalskd fjalksd"], ["created_at", "2014-10-09 23:48:04.579104"], ["creator_id", 2], ["group_id", 1], ["title", "Moi"], ["updated_at", "2014-10-09 23:48:04.579104"]]