app/controllers/snippets_controller.rb

	def new
		@group = Group.find(params[:group_id])
		@user = User.find(params[:user_id])
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

	def create
		group = Group.find(params[:group_id])
		user = User.find(params[:user_id])
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]